## 3. Capturing NAN values with a new feature

1. This technique works best when data is not missing completely at random. In this, we add a new column in the dataset and replace all NaN values with 1 or 0.

2. By doing this we get easy visualization of null values i.e, we can easily track the null values

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r"C:\Users\Harsh Jain\Desktop\HARSH JAIN\3. EVERYTHING RELATED TO DATA\DATA SCIENCE\DATASETS\titanic train.csv",usecols=['Age','Fare','Survived'])

In [3]:
df.head()

   Survived   Age     Fare
0         0  22.0   7.2500
1         1  38.0  71.2833
2         1  26.0   7.9250
3         1  35.0  53.1000
4         0  35.0   8.0500

In [4]:
#Here we'll create a new feature Age_Nan
df['Age_NAN']=np.where(df['Age'].isnull(),1,0)

In [5]:
df.head(10)

   Survived   Age     Fare  Age_NAN
0         0  22.0   7.2500        0
1         1  38.0  71.2833        0
2         1  26.0   7.9250        0
3         1  35.0  53.1000        0
4         0  35.0   8.0500        0
5         0   NaN   8.4583        1
6         0  54.0  51.8625        0
7         0   2.0  21.0750        0
8         1  27.0  11.1333        0
9         1  14.0  30.0708        0

### ADVANTAGES AND DISADVANTAGES:

1. Advntages:
    
    1. Easy to implement
    2. Captures the importance of missing values

2. Disadvantages:
    
    1. Creating Additional Features(Curse of Dimensionality)